## Terraform Plans 🌍

<details>
<summary><b>DEV</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=f7b2e648-7a7a-4bed-9f26-0ba5be79aeb0]
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=9e85af3f-f014-442c-8bb8-6a8ea42aa7d7]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=eca42820-3320-4668-86c8-e4396489ab1c]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=814bf55a-3dab-4762-9349-cba5eb065273]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=9149e9c8-e023-4e8c-986d-e408be9dbc39]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=f7b2e648-7a7a-4bed-9f26-0ba5be79aeb0]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=9e85af3f-f014-442c-8bb8-6a8ea42aa7d7]
module.core_workspace.terraform_data.warehouse_schemas: Refreshing state... [id=18298f8b-91fd-9f9d-cbdf-ec789f479bf1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.core_workspace.terraform_data.warehouse_schemas is tainted, so must be replaced
-/+ resource "terraform_data" "warehouse_schemas" {
      ~ id               = "18298f8b-91fd-9f9d-cbdf-ec789f479bf1" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

<details>
<summary><b>TEST</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=ab6695ef-28d6-4afc-8b5f-cd7f934f6c58]
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=0469861f-328f-4ea6-96fc-8b1c01cf69a5]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=4ba0dcfe-219c-4a7d-a5af-6961afcf28e9]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=0469861f-328f-4ea6-96fc-8b1c01cf69a5]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=465f60e1-9b54-4eff-aca1-5a0aab9d76b3]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=ab6695ef-28d6-4afc-8b5f-cd7f934f6c58]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=7d235c03-f4f4-49db-85ce-c1e05fe39672]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core_workspace.terraform_data.warehouse_schemas will be created
  + resource "terraform_data" "warehouse_schemas" {
      + id               = (known after apply)
      + triggers_replace = [
          + "465f60e1-9b54-4eff-aca1-5a0aab9d76b3",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

<details>
<summary><b>PROD</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.entra_groups.azuread_group.business_admins["sales"]: Refreshing state... [id=e652a758-5323-40a0-8d01-598f46be7b16]
module.entra_groups.azuread_group.business_admins["finance"]: Refreshing state... [id=bdcdb8a0-005a-446c-be18-fd1a7dc04d0c]
module.entra_groups.azuread_group.app_viewers_domain["marketing"]: Refreshing state... [id=f2060366-7333-4134-aec4-6e4a7c7f87fa]
module.entra_groups.azuread_group.business_admins["marketing"]: Refreshing state... [id=716b60a9-2d8b-4200-897b-c5d3cd50ba1a]
module.entra_groups.azuread_group.business_contributors["marketing"]: Refreshing state... [id=1ce239a4-38f9-48b4-b959-87802c074f22]
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=4b6f3554-cf7e-462e-9b34-96d646941f1e]
module.entra_groups.azuread_group.app_viewers_domain["finance"]: Refreshing state... [id=4931e9d8-51b4-49b5-bbe9-214c822b251e]
module.entra_groups.azuread_group.app_viewers_domain["sales"]: Refreshing state... [id=3633236c-38f6-4c67-8a8f-69bc92eedb38]
module.entra_groups.azuread_group.business_contributors["sales"]: Refreshing state... [id=74d1828f-ebf3-43da-872a-1da75821672b]
module.entra_groups.azuread_group.business_contributors["finance"]: Refreshing state... [id=da306201-858f-4a68-9f0f-0378045423c9]
module.entra_groups.azuread_group.cicd_approvers[0]: Refreshing state... [id=4d85c560-086a-4848-830d-4067d5c492e7]
module.entra_groups.azuread_group.platform_admins[0]: Refreshing state... [id=8d3fa260-01af-4840-a7b8-054b20040743]
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=0a676489-204e-4f9b-a988-41dcbba44dd5]
module.entra_groups.azuread_group.app_viewers_org[0]: Refreshing state... [id=4d4b6d7e-5074-4acd-a17b-1a3245300b5b]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=b6c8c15b-114e-421e-a3a9-c47bf7863340]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=4b6f3554-cf7e-462e-9b34-96d646941f1e]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=0a676489-204e-4f9b-a988-41dcbba44dd5]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=b841c1f4-b496-4a71-8928-5b645391b458]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=39270f70-6172-40c3-b066-8a69970fc79b]
module.domain_workspace[0].fabric_workspace.domain: Refreshing state... [id=71e758ba-711c-4619-839c-98b957516f3f]
module.domain_workspace[0].fabric_workspace_role_assignment.admin: Refreshing state... [id=8d3fa260-01af-4840-a7b8-054b20040743]
module.domain_workspace[0].fabric_lakehouse.domain: Refreshing state... [id=8104457a-b896-475b-8043-4595b6815806]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core_workspace.terraform_data.warehouse_schemas will be created
  + resource "terraform_data" "warehouse_schemas" {
      + id               = (known after apply)
      + triggers_replace = [
          + "b841c1f4-b496-4a71-8928-5b645391b458",
        ]
    }

  # module.domain_workspace[0].fabric_shortcut.warehouse_gold will be created
  + resource "fabric_shortcut" "warehouse_gold" {
      + id           = (known after apply)
      + item_id      = "8104457a-b896-475b-8043-4595b6815806"
      + name         = "core_warehouse_gold"
      + path         = "Tables"
      + target       = {
          + external_data_share = (known after apply)
          + onelake             = {
              + item_id      = "b841c1f4-b496-4a71-8928-5b645391b458"
              + path         = "Tables/gold"
              + workspace_id = "b6c8c15b-114e-421e-a3a9-c47bf7863340"
            }
          + type                = (known after apply)
        }
      + workspace_id = "71e758ba-711c-4619-839c-98b957516f3f"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: 'Shortcut' preview mode

  with module.domain_workspace[0].fabric_shortcut.warehouse_gold,
  on modules/domain-workspace/main.tf line 28, in resource "fabric_shortcut" "warehouse_gold":
  28: resource "fabric_shortcut" "warehouse_gold" {

The 'Shortcut' behavior may change in future releases without notice or
compatibility guarantees.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

